[
    {
        "name": "my-welfare",
        "title": "MyWelfare.ie",
        "role": "Website redesign",
        "description": "Redesigning the online home for social welfare services in Ireland, by learning and iterating with Irish citizens.",
        "img": "../assets/final/MyWelfare-iMac4.png",
        "mobileImg": "../assets/final/mobile/MyWelfare-iMac4.png",
        "imgAltText": "Image of My Welfare homepage",
        "imageFlexOrder": 1,
        "summaryFlexOrder": 2,
        "button": "Learn more",
        "textColor": "#231F20",
        "summaryWidth": "270px",
        "index": 1,
        "backgroundGradient": "#FBF7FC",
        "marginTop": "100px",
        "marginBottom": "-4px",
        "maxHeight": "890px",
        "projectTemplate": "template1",
        "intro": {
            "title": "MyWelfare",
            "subheader": "The online home for social welfare services for every Irish citizen.",
            "paragraph": "Welfare services are used by everyone at some point in their lives, usually at a difficult or stressful time. Users found the old MyWelfare platform difficult to use as they were being blocked by a login wall. This meant that they were not able to find what they were looking for, or browse through any of the available services. In addition, the old site was not scalable for the addition of new services by the business.",
            "button": "Visit website",
            "buttonLink": "https://services.mywelfare.ie/",
            "backgroundGradient": "#CFDBE0",
            "marginTop": "100px",
            "marginBottom": "-4px"
        },
        "section1": {
            "number": "01",
            "header": "A new  CMS",
            "paragraph": "I contributed to the design of a CMS that would allow information to be accessible to users without having to login. It pushes the important information to the front of the site, and allows users to browse before applying for their service. It also allows the business to easily update and manage the information on their site.",
            "image": "../assets/final/MyWelfare_001-MacBook-Silver.png",
            "imgAltText": "Image of My Welfare parents, children and family page",
            "mobileImg": "../assets/final/mobile/MyWelfare_001-MacBook-Silver.png",
            "bleedToEdge": false,
            "maxHeight": "690px",
            "backgroundGradient": "#FBF7FC",
            "marginTop": "100px",
            "marginBottom": "100px"
        },
        "section2": {
            "number": "02",
            "header": "Information architecture",
            "paragraph": "I assisted in the redesign of the information structure of the site. I created cards with all MyWelfare current and future services on them so that the business could sort them into service categories. \n\nI led guerrilla user testing sessions with citizens to see whether they knew where to find the services they were applying for. I highlighted areas to the business where users were confused or unable to find their service. I contributed to the iteration of the prototype until navigation of the site was clear to all users.",
            "image": "../assets/final/MyWelfare-T12-1.png",
            "imgAltText": "Image of My Welfare pension pages on mobile",
            "mobileImg": "../assets/final/mobile/MyWelfare-T12-1.png",
            "bleedToEdge": false,
            "maxHeight": "690px",
            "backgroundGradient": "white",
            "marginTop": "0px",
            "marginBottom": "0px"
        },
        "section3": {
            "number": "03",
            "header": "Accessible by default",
            "paragraph": "The old website required the user to choose to display an accessible version of the site. We removed this choice, and ensured all colours and fonts were accessible to everyone by default.\n\nDuring this project we identified six core design principles for the addition of any future digital services on MyWelfare.",
            "image": "../assets/final/MyWelfare-clay-desktop2.png",
            "imgAltText": "Image of My Welfare pension and home pages",
            "mobileImg": "../assets/final/mobile/MyWelfare-clay-desktop2.png",
            "bleedToEdge": false,
            "maxHeight": "1100px",
            "backgroundGradient": "#FBF7FC",
            "marginTop": "100px",
            "marginBottom": "100px"
        }
    },
    {
        "name": "my-welfare-creation-kit",
        "title": "MyWelfare CreationKit",
        "role": "Design system",
        "description": "The design system which builds consistency and efficiency into all MyWelfare services, through the use of scalable components and patterns.",
        "img": "../assets/final/Group.png",
        "imgAltText": "Image of the My Welfare Creation Kit design system",
        "mobileImg": "../assets/final/mobile/Group.png",
        "imageFlexOrder": 2,
        "summaryFlexOrder": 1,
        "button": "Learn more",
        "textColor": "#231F20",
        "summaryWidth": "270px",
        "marginTop": "0px",
        "marginBottom": "0px",
        "maxHeight": "976px",
        "index": 2,
        "backgroundGradient": "linear-gradient(180deg, #FFFFFF 0%, #FFFFFF 100%)",
        "transformGradient": "scaleY(-1)",
        "projectTemplate": "template1",
        "intro": {
            "title": "MyWelfare CreationKit",
            "subheader": "A design system that builds consistency and efficiency into all MyWelfare services.",
            "paragraph": "The CreationKit is a single source of truth for designers and developers on MyWelfare. While the MyWelfare platform grew and evolved, overall rules and processes were not put in place to help with this growth. Patterns, colours and font styles were not consistent throughout the site. These needed to be identified and brought to life in a way that would help designers and developers iterate and add to them as the site grows."
        },
        "section1": {
            "number": "01",
            "header": "A component and style inventory",
            "paragraph": "I gathered all assets, components, and font styles used on the site, both live and in progress, and decided where they would live on the CreationKit. \n\nThis involved sifting through countless files and combing the live MyWelfare site so that every style or pattern would be accounted for going forward.",
            "image": "../assets/final/Getting Started.png",
            "imgAltText": "Image of the My Welfare Creation Kit home page",
            "mobileImg": "../assets/final/mobile/Getting Started.png",
            "bleedToEdge": false,
            "maxHeight": "1100px",
            "backgroundGradient": "#F8FAFF",
            "marginTop": "100px",
            "marginBottom": "100px"
        },
        "section2": {
            "number": "02",
            "header": "Distilling the brand",
            "paragraph": "Components, colours and fonts were being used in quite a flexible way on the site. After creating a component and style inventory I worked on strengthening the design rules and patterns that were loosely in place on the site. I merged similar colours and refined icons and typographic styles where needed. I built this new, distilled brand into the CreationKit, but also marked areas of the site for maintenance where further development work was needed.",
            "image": "../assets/final/Active claim card notifications.png",
            "imgAltText": "Image of the Job Seekers Payment page",
            "mobileImg": "../assets/final/mobile/Active claim card notifications.png",
            "bleedToEdge": false,
            "maxHeight": "940px",
            "backgroundGradient": "white",
            "marginTop": "0px",
            "marginBottom": "0px"
        },
        "section3": {
            "number": "03",
            "header": "A robust and scalable site",
            "paragraph": "My Welfare’s visual style is based on card-based metaphors. Each card contains succinct pieces of information that are easy to digest. This allows for easy scalability of components, as each component should inherit characteristics of those already created. \n\nWhile building the CreationKit I created a Sketch library file with all consolidated components, buttons and styles to increase efficiency when iterating and creating new products.",
            "image": "../assets/final/CreationKit-typography.png",
            "imgAltText": "Image of the My Welfare Creation Kit Typography",
            "mobileImg": "../assets/final/mobile/CreationKit-typography.png",
            "bleedToEdge": true,
            "maxHeight": "1100px",
            "backgroundGradient": "#F8FAFF",
            "marginTop": "100px",
            "marginBottom": "0px"
        }
    },
    {
        "name": "money-management-tool",
        "title": "Ulster Bank Hackathon",
        "role": "Built-in app",
        "description": "Empowering the elderly and vulnerable in society to complete their everyday banking needs by integrating new functionality into the current Ulster Bank app.",
        "img": "../assets/final/UB_phone_1.png",
        "imgAltText": "Image of the money management mobile app, showing the ability to change the permissions on who can see account information",
        "mobileImg": "../assets/final/mobile/UB_phone_1.png",
        "imgOrientation": "portrait",
        "imageFlexOrder": 1,
        "summaryFlexOrder": 2,
        "button": "Learn more",
        "textColor": "#231F20",
        "summaryWidth": "295px",
        "marginTop": "100px",
        "marginBottom": "0px",
        "maxHeight": "1000px",
        "index": 3,
        "backgroundGradient": "#FCF4FA",
        "projectTemplate": "template1",
        "intro": {
            "title": "Ulster Bank Hackathon",
            "subheader": "Empowering the elderly and vulnerable in society to complete their everyday banking needs.",
            "paragraph": "In Ireland, financial abuse of the elderly is on the rise, and the perpetrators are most often family members or people in positions of trust. I identified this as a problem and led our team in bringing financial transparency to elderly people's everyday lives. We built an app to prevent financial exclusion for the elderly and vulnerable, and not further enable this abuse."
        },
        "section1": {
            "number": "01",
            "header": "Understanding the target audience",
            "paragraph": "I created two personas: Mary who lives in Cork and her son Darragh who lives in Dublin. Mary was afraid of financial scams, and wanted to be able to manage her money as her branch had just closed. Darragh wanted to help his mother from afar, and wanted her to feel safe and confident that her finances were being taken care of.",
            "image": "../assets/final/Persona-Mary.png",
            "imgAltText": "Image of the person created: Mary, pensioner from Fermoy, Cork",
            "mobileImg": "../assets/final/mobile/Persona-Mary.png",
            "bleedToEdge": false,
            "maxHeight": "900px",
            "backgroundGradient": "#FCF4FA",
            "marginTop": "100px",
            "marginBottom": "100px"
        },
        "section2": {
            "number": "02",
            "header": "Establishing a third party within the app",
            "paragraph": "I gave Mary the ability to add Darragh and his siblings to her account, so that they could all have visibility over her account, and ensure financial transparency within the family. This would give Mary the ability to delegate a task to Darragh, and would give Fidelma and Sarah visibility over Darragh’s expenditure.",
            "image": "../assets/final/Establish-3rd-party_1.png",
            "imgAltText": "Image of the 'Your Trusted People' section of the app",
            "mobileImg": "../assets/final/mobile/Establish-3rd-party_1.png",
            "bleedToEdge": false,
            "maxHeight": "900px",
            "backgroundGradient": "white",
            "marginTop": "0px",
            "marginBottom": "0px"
        },
        "section3": {
            "number": "03",
            "header": "The ability to manage permissions in realtime",
            "paragraph": "Mary could set what actions Darragh and his siblings could complete on her account. She could do this quickly within the app, without having to call the bank or travel into the branch in the next town over.",
            "image": "../assets/final/UB-bottom.png",
            "imgAltText": "",
            "mobileImg": "../assets/final/mobile/UB-bottom.png",
            "bleedToEdge": true,
            "maxHeight": "2000px",
            "backgroundGradient": "white",
            "marginTop": "0px",
            "marginBottom": "0px"
        }
    },
    {
        "name": "bioeffect",
        "title": "BioEffect skincare",
        "role": "Brand book",
        "description": "The story behind the Icelandic scientific skincare company BioEffect. A company founded when three geneticists found a way to create an anti-aging serum using barley.",
        "img": "../assets/final/Bio_Mockup_2.2.png",
        "imgAltText": "Image of Bio Effect book",
        "mobileImg": "../assets/final/mobile/Bio_Mockup_2.2.png",
        "imageFlexOrder": 2,
        "summaryFlexOrder": 1,
        "button": "Learn more",
        "textColor": "#231F20",
        "summaryWidth": "270px",
        "marginTop": "",
        "marginBottom": "0px",
        "maxHeight": "1200px",
        "index": 4,
        "projectTemplate": "template2",
        "intro": {
            "title": "BioEffect skincare",
            "subheader": "An Icelandic skincare brand built through science, not beauty.",
            "paragraph": "Recently breaking into the US market, Icelandic skincare brand BioEffect has been growing into an international household name. Founded through science without a commercial target in mind, BioEffect needed to define their brand, and we helped them do this through the process of creating a Brand book."
        },
        "section1": {
            "number": "01",
            "header": "The book",
            "paragraph": "The brand book tells the story of BioEffect. It takes the reader through BioEffect’s scientific conception, to their emergence in the skincare sector. BioEffect radiates purity, and I designed the brand book with this at the forefront of my mind.",
            "image": "../assets/final/Bio_Mockup_3.png",
            "mobileImg": "../assets/final/mobile/Bio_Mockup_3.png",
            "imgAltText": "",
            "bleedToEdge": false,
            "maxHeight": "1500px",
            "backgroundGradient": "linear-gradient(135deg, #272D35 0%, #839BA7 100%)",
            "textColor": "#ffffff"
        },
        "section2": {
            "number": "02",
            "header": "Iceland at its heart",
            "paragraph": "Iceland is a country of harsh landscapes and rustic nature, and I identified this as being a large part of where BioEffect's identity stemmed from too. I used a selection of Icelandic landscape photography commissioned for the book, and worked with a product photographer to create stunning images of the product itself.",
            "image": "../assets/final/Bio_Mockup_1.png",
            "mobileImg": "../assets/final/mobile/Bio_Mockup_1.png",
            "imgAltText": "",
            "bleedToEdge": false,
            "maxHeight": "1500px",
            "backgroundGradient": "linear-gradient(135deg, #FFFFFF 0%, #F2F2F2 100%)",
            "textColor": "#231F20"
        }
    },
    {
        "name": "hilliard-studio-method",
        "title": "Hilliard Studio Method",
        "role": "Ecommerce website redesign",
        "description": "A fitness studio focused on building female strength and power, Hilliard Studio Method wanted to extend their brand and expand into ecommerce and online streaming.",
        "img": "../assets/final/HSM-front-page-1.png",
        "imgAltText": "Image of the Hillliad Studio Method mobile app home page",
        "mobileImg": "../assets/final/mobile/HSM-front-page-1.png",
        "imageFlexOrder": 1,
        "summaryFlexOrder": 2,
        "button": "Learn more",
        "textColor": "#231F20",
        "summaryWidth": "270px",
        "marginTop": "100px",
        "marginBottom": "-4px",
        "maxHeight": "1585px",
        "index": 5,
        "backgroundGradient": "#F0F9FA",
        "projectTemplate": "template3",
        "intro": {
            "title": "Hilliard Studio Method",
            "subheader": "Radiating feminine fitness and power through an ecommerce and live streaming website.",
            "paragraph": "Hilliard Studio Method is a fitness studio founded by mother-daughter duo, Liz and Clary. Originally founded as a physical studio in their hometown of North Carolina, Hilliard Studio Method's website was not built for selling products online, and there was nowhere that customers could stream classes remotely.",
            "button": "Visit website",
            "buttonLink": "https://hilliardstudiomethod.com/"
        },
        "section1": {
            "number": "01",
            "header": "Remote workouts",
            "paragraph": "Some of Liz and Clary's customers wanted to be able to enjoy classes in the comfort of their own home, so they began streaming their classes and workouts on a third-party site. Their old website did not promote their online streaming services, and only focused on promoting classes in their physical studio. I reorganised the priority on the homepage of the website to cater for both physical and virtual studios in the one space, while also refreshing the overall Hilliard Studio Method brand.",
            "image": "../assets/final/Macbook-hsm2.png",
            "imgAltText": "Image of website homepage",
            "mobileImg": "../assets/final/mobile/Macbook-hsm2.png",
            "bleedToEdge": true,
            "maxHeight": "2000px",
            "backgroundGradient": "#D9E4EA"
        },
        "section2": {
            "number": "02",
            "header": "An online shopping experience",
            "paragraph": "As a natural progression from the move to online streaming, Liz and Clary wanted to set up an online store. They had already started selling clothing, beauty products and health supplements in their physical studio in North Carolina, but saw an opportunity to expand this to their online audience in parallel with their streaming service. \n\nI worked closely with a developer on my team to create an online store that could be easily updated by Hilliard Studio Method’s team. We created a Wordpress CMS which allows Liz and Clary’s team to update their products quickly and intuitively.",
            "image": "../assets/final/Macbook-hsm-3 copy.png",
            "imgAltText": "",
            "mobileImg": "../assets/final/mobile/Macbook-hsm-3 copy.png",
            "bleedToEdge": false,
            "maxHeight": "900px",
            "backgroundGradient": "linear-gradient(135deg, #FFFFFF 0%, #F2F2F2 100%)"
        }
    },
    {
        "name": "whitehat-learning-platform",
        "title": "WhiteHat Learning Platform",
        "role": "Product Design",
        "description": "Restructuring the architecture and usability of an outdated platform to allow apprentices to have a positive learning experience.",
        "img": "../assets/final/Sitemap-1.png",
        "imgAltText": "Image of the My Welfare Creation Kit design system",
        "mobileImg": "../assets/final/Sitemap-1.png",
        "imageFlexOrder": 2,
        "summaryFlexOrder": 1,
        "button": "Learn more",
        "textColor": "#231F20",
        "summaryWidth": "270px",
        "marginTop": "0px",
        "marginBottom": "0px",
        "maxHeight": "976px",
        "index": 6,
        "backgroundGradient": "linear-gradient(180deg, #FFFFFF 0%, #FFFFFF 100%)",
        "transformGradient": "scaleY(-1)",
        "projectTemplate": "template1",
        "intro": {
            "title": "WhiteHat learning platform",
            "subheader": "Transforming the apprentice online learning experience.",
            "paragraph": "WhiteHat provides access to career-focused apprenticeships for young people. Apprentices balance learning in their job with WhiteHat coaching sessions. Apprentices found the old learning platform difficult to navigate, and not intuitive to use. Meanwhile, WhiteHat coaches time was taken up with admin tasks that should have been facilitated through the learning product."
        },
        "section1": {
            "number": "01",
            "header": "Research to validate assumptions",
            "paragraph": "Before starting the project, work had been done by internal stakeholders to decide what an improved platform might look like, and a lot of problems identified were based on their assumptions. To be able to understand the key problems and pain points, I set out to validate those assumptions. A lot of the knowledge about the platform was shared internally and externally between many people, so I conducted interviews with our three main users: apprentices, line managers and coaches.",
            "image": "../assets/final/Research.png",
            "imgAltText": "Quotes from research interviews",
            "mobileImg": "../assets/final/Research.png.png",
            "bleedToEdge": false,
            "maxHeight": "1100px",
            "backgroundGradient": "#FFFBEF",
            "marginTop": "100px",
            "marginBottom": "100px"
        },
        "section2": {
            "number": "02",
            "header": "Navigating two products within one ecosystem",
            "paragraph": "WhiteHat’s two main products are its recruitment and learning platforms. These platforms currently exist in separate ecosystems, as the learning platform was originally an out-of-the-box solution. By redesigning the learning platform in-house, we have an opportunity to bridge the apprentice’s recruitment and learning experiences. \n\nWe approached the project in an agile way, by rebuilding the learning platform feature-by-feature. This meant reviewing the architecture at the start was essential, as it’d reduce the risk of ending up with a ‘frankenstein’ product.",
            "image": "../assets/final/Navigating-two.png",
            "imgAltText": "Recruitment and learning platforms",
            "mobileImg": "../assets/final/Navigating-two.png",
            "bleedToEdge": false,
            "maxHeight": "940px",
            "backgroundGradient": "white",
            "marginTop": "0px",
            "marginBottom": "0px"
        },
        "section2a": {
            "number": "I don't think this field is used",
            "header": "Under Construcion",
            "paragraph": "Paragraph tbd.",
            "image": "../assets/final/Research.png",
            "imgAltText": "accessibility alt text",
            "mobileImg": "../assets/final/Research.png.png",
            "bleedToEdge": false,
            "maxHeight": "1100px",
            "backgroundGradient": "#FFFBEF",
            "marginTop": "100px",
            "marginBottom": "100px"
        },
        "section3": {
            "number": "03",
            "header": "Building on our knowledge of apprentices through data",
            "paragraph": "A lot of the content input on the current learning platform is in freeform text boxes. The cognitive load for coaches when assessing answers is higher, as they often have to sift through unstructured answers and paragraphs of text. \n\n By reviewing each process on the current platform, and designing with both the apprentice and coach in mind, we’re also facilitating a better collection of data. Where possible and where suitable, we’re turning unstructured data into structured. This will allow us to have a greater understanding of the apprentice’s learning journey through their qualification, and continue to build our qualifications and learning processes as we grow the business.",
            "image": "../assets/final/Data.svg",
            "imgAltText": "Quotes from research interviews",
            "mobileImg": "../assets/final/Data.svg",
            "bleedToEdge": false,
            "maxHeight": "1100px",
            "backgroundGradient": "linear-gradient(180deg, #FFFFFF 0%, #F5F7FE 100%)",
            "marginTop": "100px",
            "marginBottom": "100px"
        }
    }
]